colocation/ref-results/pgbench-50_suffixArray/pgbench-50.txt
pgbench (17.2 (Debian 17.2-1.pgdg120+1))
starting vacuum...end.
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 50
number of threads: 6
maximum number of tries: 1
duration: 250 s
number of transactions actually processed: 110000306
number of failed transactions: 0 (0.000%)
latency average = 0.114 ms
initial connection time = 21.721 ms
tps = 440037.835148 (without initial connection time)
statement latencies in milliseconds and failures:
         0.000           0  \set aid random(1, 100000 * :scale)
         0.108           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;